MoyasarTest/Fixtures/ApplePay/Paid.json

{
  "id": "a4a144ba-adc3-43bd-98e8-c80f2925fdc4",
  "status": "paid",
  "amount": 1000,
  "fee": 0,
  "currency": "SAR",
  "refunded": 0,
  "refunded_at": null,
  "description": "Test Payment",
  "amount_format": "10.00 SAR",
  "fee_format": "0.00 SAR",
  "refunded_format": "0.00 SAR",
  "invoice_id": null,
  "ip": null,
  "callback_url": null,
  "created_at": "2019-01-02T10:14:14.414Z",
  "updated_at": "2019-01-02T10:14:14.414Z",
  "source": {
    "type": "applepay",
    "company": "visa",
    "name": null,
    "number": "XXXX-XXXX-XXXX-1111",
    "message": "APPROVED",
    "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
    "reference_number": "125478454231"
  },
  "metadata": {
    "order_id": "a2620c7d-658e-4c27-aa78-bc6532549cec",
    "tax": "150"
  }
}
