MoyasarTest/Fixtures/CreditCard/Paid.json

{
  "id": "b6c01c90-a091-45a4-9358-71668ecbf7ea",
  "status": "paid",
  "amount": 1000,
  "fee": 0,
  "currency": "SAR",
  "refunded": 0,
  "refunded_at": null,
  "description": "Test Payment",
  "amount_format": "10.00 SAR",
  "fee_format": "0.00 SAR",
  "refunded_format": "0.00 SAR",
  "invoice_id": null,
  "ip": null,
  "callback_url": "https://mystore.com/order/redirect-back",
  "created_at": "2019-01-02T10:14:14.414Z",
  "updated_at": "2019-01-02T10:14:14.414Z",
  "source": {
    "type": "creditcard",
    "company": "visa",
    "name": "Long John",
    "number": "XXXX-XXXX-XXXX-1111",
    "message": "APPROVED",
    "transaction_url": "https://api.moyasar.com/v1/transaction_auths/a9a6c4c9-b065-48c6-952a-184266ec4b4a/form?token=auth_n7FoPBZo2cYriecyZvzmXrXTP13E7og9HC3jGFDYqzF"
  },
  "metadata": {
    "order_id": "5c02ba44-7fd1-444c-b82b-d3993b87d4b0",
    "tax": "50"
  }
}
